#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_repository.repositorymanager_repositories_createcdkapp_repository_766AA294: Refreshing state... [id=create-cdk-app]
github_repository.repositorymanager_repositories_bumpcdk_repository_92DFE84D: Refreshing state... [id=bump-cdk]
github_branch_protection.repositorymanager_repositories_repositorymanager_repositorymanagerprotection_0D5CA483: Refreshing state... [id=repository-manager:master]
github_repository.repositorymanager_repositories_base_repository_DC292971: Refreshing state... [id=base]
github_team.repositorymanager_teams_collaborators_team_BCA4AB9D: Refreshing state... [id=4009231]
github_repository.repositorymanager_repositories_website_repository_40CA684E: Refreshing state... [id=website]
github_branch_protection.repositorymanager_repositories_website_websiteprotection_17DC3BCD: Refreshing state... [id=website:master]
github_membership.repositorymanager_members_pgollucci_pgolluccimembership_E545EF82: Refreshing state... [id=cdk-dev:pgollucci]
github_team.repositorymanager_teams_tools_team_75DFBC41: Refreshing state... [id=4013006]
github_repository.repositorymanager_repositories_repositorymanager_repository_47ED2DF3: Refreshing state... [id=repository-manager]
github_repository.repositorymanager_repositories_bumpcdkaction_repository_8E012F11: Refreshing state... [id=bump-cdk-action]
github_membership.repositorymanager_members_wulfmann_wulfmannmembership_F02CADC3: Refreshing state... [id=cdk-dev:wulfmann]
github_team_repository.repositorymanager_repositories_website_teamgithubteamrepositorymanagerteamscollaboratorsteamBCA4AB9Did_7CADE29C: Refreshing state... [id=4009231:website]
github_team_membership.repositorymanager_teams_collaborators_membershipcollaboratorswulfmann_D7C1D8AC: Refreshing state... [id=4009231:wulfmann]
github_team_membership.repositorymanager_teams_collaborators_membershipcollaboratorspgollucci_94781C69: Refreshing state... [id=4009231:pgollucci]
github_team_repository.repositorymanager_repositories_bumpcdk_teamgithubteamrepositorymanagerteamstoolsteam75DFBC41id_175C1E14: Refreshing state... [id=4013006:bump-cdk]
github_team_repository.repositorymanager_repositories_bumpcdkaction_teamgithubteamrepositorymanagerteamstoolsteam75DFBC41id_004DB079: Refreshing state... [id=4013006:bump-cdk-action]
github_team_membership.repositorymanager_teams_tools_membershiptoolswulfmann_53E47FFC: Refreshing state... [id=4013006:wulfmann]
github_team_repository.repositorymanager_repositories_createcdkapp_teamgithubteamrepositorymanagerteamstoolsteam75DFBC41id_84AC467F: Refreshing state... [id=4013006:create-cdk-app]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.repositorymanager_repositories_linkscraper_linkscraperprotection_632CB080 will be created
  + resource "github_branch_protection" "repositorymanager_repositories_linkscraper_linkscraperprotection_632CB080" {
      + branch                 = "master"
      + enforce_admins         = false
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "link-scraper"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + required_approving_review_count = 1
        }
    }

  # github_repository.repositorymanager_repositories_linkscraper_repository_00BB1E53 will be created
  + resource "github_repository" "repositorymanager_repositories_linkscraper_repository_00BB1E53" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Extract Preview Data from Websites"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.dev"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "link-scraper"
      + node_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "aws-cdk",
          + "cdk",
          + "cdk8s",
          + "cdktf",
          + "constructs",
          + "jsii",
          + "terraform-cdk",
        ]
    }

  # github_team_repository.repositorymanager_repositories_linkscraper_teamgithubteamrepositorymanagerteamscollaboratorsteamBCA4AB9Did_F9E2D556 will be created
  + resource "github_team_repository" "repositorymanager_repositories_linkscraper_teamgithubteamrepositorymanagerteamscollaboratorsteamBCA4AB9Did_F9E2D556" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "link-scraper"
      + team_id    = "4009231"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*